<a href="https://colab.research.google.com/github/JuliaCherep/innopolis/blob/Test1/%D0%9A%D0%BE%D0%BF%D0%B8%D1%8F_%D0%B1%D0%BB%D0%BE%D0%BA%D0%BD%D0%BE%D1%82%D0%B0_%22DA_Preproc_ipynb%22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
data = pd.Series(['fdfd', 'fdfddd', np.nan, 'bb', None, 'cc'])

In [ ]:
data.isnull()

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [ ]:
data.notnull()

0     True
1     True
2    False
3     True
4    False
5     True
dtype: bool

In [ ]:
# data.dropna(inplace=True)

In [ ]:
data

0      fdfd
1    fdfddd
2       NaN
3        bb
4      None
5        cc
dtype: object

In [ ]:
data.fillna(value='aaa')

0      fdfd
1    fdfddd
2       aaa
3        bb
4       aaa
5        cc
dtype: object

In [ ]:
data.fillna(method='backfill')

0      fdfd
1    fdfddd
2        bb
3        bb
4        cc
5        cc
dtype: object

In [ ]:
df = pd.DataFrame([['fdfd', 'fdfddd', np.nan, 'bb', None, 'cc'], ['fdfd',np.nan, 'fdfddd', 'bb', None, 'cc'],[ np.nan, 'fdfddd', 'bb', None, None]])

In [ ]:
df

      0       1       2     3     4     5
0  fdfd  fdfddd     NaN    bb  None    cc
1  fdfd     NaN  fdfddd    bb  None    cc
2   NaN  fdfddd      bb  None  None  None

In [ ]:
df.isnull()

       0      1      2      3     4      5
0  False  False   True  False  True  False
1  False   True  False  False  True  False
2   True  False  False   True  True   True

In [ ]:
df[df[2].notnull()]

      0       1       2     3     4     5
1  fdfd     NaN  fdfddd    bb  None    cc
2   NaN  fdfddd      bb  None  None  None

In [ ]:
df

      0       1       2     3     4     5
0  fdfd  fdfddd     NaN    bb  None    cc
1  fdfd     NaN  fdfddd    bb  None    cc
2   NaN  fdfddd      bb  None  None  None

In [ ]:
df.dropna(axis=1, how='all')

      0       1       2     3     5
0  fdfd  fdfddd     NaN    bb    cc
1  fdfd     NaN  fdfddd    bb    cc
2   NaN  fdfddd      bb  None  None

In [ ]:
df.dropna(how='all')

      0       1       2     3     4     5
0  fdfd  fdfddd     NaN    bb  None    cc
1  fdfd     NaN  fdfddd    bb  None    cc
2   NaN  fdfddd      bb  None  None  None

In [ ]:
df.fillna(0.0, inplace=True)

In [ ]:
df[df.notnull()] = 1.2

In [ ]:
df[df<=0.0] = np.nan

In [ ]:
df

     0    1    2    3   4    5
0  1.2  1.2  NaN  1.2 NaN  1.2
1  1.2  1.2  1.2  1.2 NaN  1.2
2  NaN  1.2  1.2  NaN NaN  NaN

In [ ]:
df.fillna(df.mean())

     0    1    2    3   4    5
0  1.2  1.2  1.2  1.2 NaN  1.2
1  1.2  1.2  1.2  1.2 NaN  1.2
2  1.2  1.2  1.2  1.2 NaN  1.2

In [ ]:
df.fillna({0:3, 4:25})

     0    1    2    3     4    5
0  1.2  1.2  NaN  1.2  25.0  1.2
1  1.2  1.2  1.2  1.2  25.0  1.2
2  3.0  1.2  1.2  NaN  25.0  NaN

In [ ]:
# дубликаты

In [ ]:
data2 = pd.DataFrame({'k1':['one']*3 + ['two']*4 , 'k2':[1,1,1,2,3,3,4] })
data2

    k1  k2
0  one   1
1  one   1
2  one   1
3  two   2
4  two   3
5  two   3
6  two   4

In [ ]:
data2.duplicated()

0    False
1     True
2     True
3    False
4    False
5     True
6    False
dtype: bool

In [ ]:
data2.drop_duplicates()

    k1  k2
0  one   1
3  two   2
4  two   3
6  two   4

In [ ]:
data2.drop_duplicates(['k1'])

    k1  k2
0  one   1
3  two   2

In [ ]:
data2 = pd.DataFrame({'k1':['one']*3 + ['two']*4 , 'k2':[1,1,1,2,3,3,4] })
data2

    k1  k2
0  one   1
1  one   1
2  one   1
3  two   2
4  two   3
5  two   3
6  two   4

In [ ]:
mapping = {'one':'один', 'two':'два'}

In [ ]:
data2['russian'] = data2['k1'].map(mapping)

In [ ]:
data2

    k1  k2 russian
0  one   1    один
1  one   1    один
2  one   1    один
3  two   2     два
4  two   3     два
5  two   3     два
6  two   4     два

In [ ]:
data2.replace(1, 22)

    k1  k2 russian
0  one  22    один
1  one  22    один
2  one  22    один
3  two   2     два
4  two   3     два
5  two   3     два
6  two   4     два

In [ ]:
data2

    k1  k2 russian
0  one   1    один
1  one   1    один
2  one   1    один
3  two   2     два
4  two   3     два
5  two   3     два
6  two   4     два

In [ ]:
data2['k2'].apply(lambda x: x*x)

0     1
1     1
2     1
3     4
4     9
5     9
6    16
Name: k2, dtype: int64

In [ ]:
data2['russian'].apply(lambda x: x.upper())

0    ОДИН
1    ОДИН
2    ОДИН
3     ДВА
4     ДВА
5     ДВА
6     ДВА
Name: russian, dtype: object

In [ ]:
# нормализация

In [ ]:
mu1 = 0
mu2 = 5
mu3 = 10
simga1 = 1
simga2 = 12
simga3 = 3
a = mu1 + np.random.randn(10)*simga1
b = mu2 + np.random.randn(10)*simga2
c = mu3 + np.random.randn(10)*simga3

In [ ]:
df2 = pd.DataFrame(np.array([a,b,c]))

In [ ]:
df2

,0,1,2,3,4,5,6,7,8,9
0,0.918239,1.312760,0.465135,-1.614361,0.768632,0.597258,1.576245,-1.010682,2.002144,-0.993801
1,16.854377,13.524843,-13.294734,10.294236,1.617329,9.770982,-0.281390,1.889478,5.606778,6.152219
2,13.179601,10.437897,10.094878,12.836001,10.213128,9.074173,9.622503,13.615310,11.974627,15.113341

In [ ]:
mu = df2.mean(axis=1)

In [ ]:
s = df2.std(axis=1)

In [ ]:
mu

0     0.402157
1     5.213412
2    11.616146
dtype: float64

In [ ]:
s

0    1.212045
1    8.491426
2    2.010948
dtype: float64

In [ ]:
(df2.iloc[1]-mu[1])/s[1]

0    1.370908
1    0.978803
2   -2.179627
3    0.598348
4   -0.423496
5    0.536726
6   -0.647100
7   -0.391446
8    0.046325
9    0.110559
Name: 1, dtype: float64